//* 给定2个数组，获取他们的交集，不考虑顺序，输出元素唯一

//* 输入：nums1 = [1,2,2,1], nums2 = [2,2]
//* 输出：[2]

//* 输入：nums1 = [4,9,5], nums2 = [9,4,9,8,4]
//* 输出：[9,4]

// * 解法
// 1. 先对2个数组从小到大排序，
// 2. 然后通过双指针，比较2数是否相同，如果相同加入输出数组，如果某一项大则另一指针增大，否则相反
// 3. 直到遍历完较小的数组，输出结果

function intersection(arr1, arr2) {
  if (arr1.length === 0 || arr2.length === 0) return []

  arr1 = arr1.sort((a, b) => a - b)
  arr2 = arr2.sort((a, b) => a - b)

  let collection = []

  // * 双指针的范式
  let i = 0
  let j = 0

  while (i <= arr1.length && j <= arr2.length) {
    if (arr1[i] === arr1[i + 1]) {
      i++
    } else if (arr2[j] === arr2[j + 1]) {
      j++
    } else if (arr1[i] === arr2[j]) {
      collection.push(arr2[j])
      i++
      j++
    } else {
      arr1[i] > arr2[j] ? j++ : i++
    }
  }
  return collection
}

var arr1 = [0, 1, 10, 11, 12, 13, 17, 17, 18, 20, 20, 20, 24, 26, 29, 3, 30, 30, 31, 31, 32, 34, 35, 35, 38, 4, 40, 40, 41, 42, 43, 44, 45, 46, 46, 47, 5, 5, 53, 53, 54, 55, 57, 58, 58, 59, 6, 60, 60, 61, 62, 62, 63, 64, 65, 66, 66, 66, 67, 67, 7, 70, 70, 72, 77, 79, 81, 81, 82, 82, 82, 83, 85, 85, 86, 88, 89, 89, 92, 92, 95, 95, 96, 98, 98, 98]
var arr2 = [0, 15, 16, 2, 2, 25, 34, 34, 36, 38, 39, 4, 44, 45, 48, 49, 49, 5, 50, 52, 57, 6, 61, 68, 7, 7, 73, 73, 77, 79, 8, 84, 85, 88, 89, 92, 93, 99]

console.log(intersection(arr1, arr2))
